docs: Update learning documentation for Jenkins
